{
    "general": {
        "educational": "This information is for educational purposes only and should not be considered medical advice.",
        "consultation": "Always consult with qualified healthcare professionals for medical concerns.",
        "emergency": "If you're experiencing a medical emergency, contact emergency services immediately."
    },
    
    "category_specific": {
        "nutrition": {
            "general": "Nutritional advice provided is general in nature and may not be suitable for everyone.",
            "medical": "If you have specific dietary requirements or medical conditions, consult a registered dietitian.",
            "allergies": "Always check for food allergies and consult healthcare providers about dietary restrictions."
        },
        "fitness": {
            "general": "Exercise recommendations are general guidelines and may not be suitable for everyone.",
            "safety": "Consult a healthcare provider before starting any new exercise program.",
            "injury": "Stop exercise and seek medical attention if you experience pain or discomfort."
        },
        "mental_health": {
            "general": "Mental health information provided is for general awareness only.",
            "crisis": "If you're experiencing a mental health crisis, contact mental health emergency services.",
            "treatment": "For mental health treatment, consult licensed mental health professionals."
        },
        "sleep": {
            "general": "Sleep recommendations are general guidelines and may not address specific sleep disorders.",
            "medical": "If you have persistent sleep problems, consult a sleep specialist or healthcare provider."
        },
        "medication": {
            "general": "Never start, stop, or modify medication without consulting your healthcare provider.",
            "interaction": "Always discuss potential medication interactions with your healthcare provider."
        }
    },
    
    "special_populations": {
        "pregnancy": "If you are pregnant or nursing, consult your healthcare provider before making any health changes.",
        "chronic_conditions": "If you have chronic health conditions, work with your healthcare team for personalized advice.",
        "children": "For children's health concerns, always consult with pediatric healthcare providers.",
        "elderly": "Older adults should consult healthcare providers for age-appropriate health recommendations."
    }
}
